In [1]:
import sqlite3, pandas as pd
conn = sqlite3.connect("db/seoul_bus_172.db")

print(pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn))

print(pd.read_sql("""
  SELECT date, route_no, stop_id, stop_name, board_total, alight_total
  FROM fact_demand_daily_stop
  ORDER BY date, stop_id
  LIMIT 5;
""", conn))

print(pd.read_sql("""
  SELECT use_ym, route_no, stop_id, hour, board_total, alight_total
  FROM fact_demand_monthly_hourly_stop
  ORDER BY stop_id, hour
  LIMIT 5;
""", conn))

conn.close()

                              name
0                    dim_stop_link
1           fact_demand_daily_stop
2  fact_demand_monthly_hourly_stop
3                    dim_route_map
       date route_no    stop_id             stop_name  board_total  \
0  20250601      172  100000002    Ï∞ΩÍ≤ΩÍ∂Å.ÏÑúÏö∏ÎåÄÌïôÍµêÎ≥ëÏõê(00028)           42
1  20250601      172  100000003      Î™ÖÎ•ú3Í∞Ä.ÏÑ±ÎåÄÏûÖÍµ¨(00027)          129
2  20250601      172  100000005  ÌòúÌôîÎèôÎ°úÌÑ∞Î¶¨.Ïó¨Ïö¥ÌòïÌôúÎèôÌÑ∞(00026)           69
3  20250601      172  100000076    Ï∞ΩÎçïÍ∂Å.Ïö∞Î¶¨ÏÜåÎ¶¨Î∞ïÎ¨ºÍ¥Ä(00029)          105
4  20250601      172  100000103    Ï∞ΩÎçïÍ∂Å.Ïö∞Î¶¨ÏÜåÎ¶¨Î∞ïÎ¨ºÍ¥Ä(00078)          162

   alight_total
0            67
1           115
2           184
3           187
4           147
   use_ym route_no    stop_id  hour  board_total  alight_total
0  202506      172  100000002     0            0             0
1  202506      172  100000002     1            0             0
2  202506      172  100000002     2            0             0
3  202506      172  100000002     3            0             0
4  202506      172  100000002     4           67           220

In [2]:
import sqlite3
import pandas as pd

# DB Í≤ΩÎ°ú
DB_PATH = "db/seoul_bus_172.db"

# Ïó∞Í≤∞
conn = sqlite3.connect(DB_PATH)

# 1) ÌÖåÏù¥Î∏î Î™©Î°ù ÌôïÏù∏
tables = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
print("üìå ÌÖåÏù¥Î∏î Î™©Î°ù:")
print(tables)

# 2) daily_stop_hourÏóêÏÑú Ìñâ Ïàò ÌôïÏù∏
row_count = pd.read_sql("SELECT COUNT(*) as cnt FROM daily_stop_hour;", conn)
print("\nüìå daily_stop_hour Ï¥ù Î†àÏΩîÎìú Ïàò:")
print(row_count)

# 3) daily_stop_hourÏóêÏÑú ÏïûÎ∂ÄÎ∂Ñ ÏÉòÌîå Ï°∞Ìöå
sample = pd.read_sql("SELECT * FROM daily_stop_hour LIMIT 10;", conn)
print("\nüìå daily_stop_hour ÏÉòÌîå:")
print(sample)

conn.close()

üìå ÌÖåÏù¥Î∏î Î™©Î°ù:
                              name
0                    dim_stop_link
1           fact_demand_daily_stop
2  fact_demand_monthly_hourly_stop
3                    dim_route_map
4             fact_ops_hourly_stop
5                  daily_stop_hour

üìå daily_stop_hour Ï¥ù Î†àÏΩîÎìú Ïàò:
      cnt
0  586440

üìå daily_stop_hour ÏÉòÌîå:
        Í∏∞Ï§Ä_ÎÇ†Ïßú      ÎÖ∏ÏÑ†ID     Ï†ïÎ•òÏû•_ID  ÏãúÍ∞Ñ  ÏäπÏ∞®Ïù∏Ïõê  ÌïòÏ∞®Ïù∏Ïõê ÎÖ∏ÏÑ†Î≤àÌò∏    Ïó≠Î™Ö  Ï†ïÎ•òÏû•_ÏàúÏÑú  Ïö¥ÌñâÌöüÏàò  \
0  2025-06-01  11110028  121500100   0   0.0   0.0  172  None       0     0
1  2025-06-01  11110028  207000613   0   0.0   0.0  172  None       0     0
2  2025-06-01  11110028  207000614   0   0.0   0.0  172  None       0     0
3  2025-06-01  11110028  214000189   0   0.0   0.0  172  None       0     0
4  2025-06-01  11110028  214000197   0   0.0   0.0  172  None       0     0
5  2025-06-01  11110028  214000252   0   0.0   0.0  172  None       0     0
6  2025-06-01  11110028  214000259   0   0.0   0.0  172  None       0     0
7  2025-06-01  11110028  214001321   0   0.0   0.0  172  None       0     0
8  2025-06-01  11110028  214001428   0   0.0   0.0  172  None       0     0
9  2025-06-01  11110028  214002009   0   0.0   0.0  172  None       0     0

  ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m
0      None
1      None
2      None
3      None
4      None
5      None
6      None
7      None
8      None
9      None

In [4]:
import sqlite3, pandas as pd
conn = sqlite3.connect("db/seoul_bus_172.db")
pd.read_sql("PRAGMA table_info(daily_stop_hour);", conn)

    cid       name     type  notnull dflt_value  pk
0     0      Í∏∞Ï§Ä_ÎÇ†Ïßú     TEXT        1       None   0
1     1       ÎÖ∏ÏÑ†ID     TEXT        0       None   0
2     2     Ï†ïÎ•òÏû•_ID     TEXT        1       None   0
3     3         ÏãúÍ∞Ñ  INTEGER        1       None   0
4     4       ÏäπÏ∞®Ïù∏Ïõê     REAL        0       None   0
5     5       ÌïòÏ∞®Ïù∏Ïõê     REAL        0       None   0
6     6       ÎÖ∏ÏÑ†Î≤àÌò∏     TEXT        0       None   0
7     7         Ïó≠Î™Ö     TEXT        0       None   0
8     8     Ï†ïÎ•òÏû•_ÏàúÏÑú  INTEGER        0       None   0
9     9       Ïö¥ÌñâÌöüÏàò  INTEGER        0       None   0
10   10  ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m     REAL        0       None   0

In [5]:
col = "ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"  # ÌôïÏù∏Îêú Ïù¥Î¶ÑÏúºÎ°ú ÏàòÏ†ï
q = f"""
SELECT 
  COUNT(*) AS total,
  SUM(CASE WHEN {col} IS NOT NULL THEN 1 ELSE 0 END) AS not_null,
  SUM(CASE WHEN {col} > 0 THEN 1 ELSE 0 END) AS gt0
FROM daily_stop_hour;
"""
pd.read_sql(q, conn)

    total  not_null  gt0
0  586440         0    0

In [6]:
col = "ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"  # ÌôïÏù∏Îêú Ïù¥Î¶Ñ
q = f"""
SELECT Í∏∞Ï§Ä_ÎÇ†Ïßú, ÎÖ∏ÏÑ†ID, Ï†ïÎ•òÏû•_ID, ÏãúÍ∞Ñ, Ï†ïÎ•òÏû•_ÏàúÏÑú, {col} AS ÎßÅÌÅ¨_m
FROM daily_stop_hour
WHERE {col} IS NOT NULL
  AND {col} > 0
  AND Ï†ïÎ•òÏû•_ÏàúÏÑú > 1
ORDER BY Í∏∞Ï§Ä_ÎÇ†Ïßú, ÏãúÍ∞Ñ, Ï†ïÎ•òÏû•_ÏàúÏÑú
LIMIT 20;
"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [Í∏∞Ï§Ä_ÎÇ†Ïßú, ÎÖ∏ÏÑ†ID, Ï†ïÎ•òÏû•_ID, ÏãúÍ∞Ñ, Ï†ïÎ•òÏû•_ÏàúÏÑú, ÎßÅÌÅ¨_m]
Index: []

In [7]:
import sqlite3, pandas as pd, numpy as np

DB = "db/seoul_bus_172.db"
MASTER = "/Users/minwoo/Desktop/softeer/DE5_Final_project/temp/ÏÑúÏö∏Ïãú ÎÖ∏ÏÑ† Ï†ïÎ•òÏû•ÎßàÏä§ÌÑ∞ Ï†ïÎ≥¥_utf8.csv"

# 1) ÎßàÏä§ÌÑ∞ Î°úÎî© (ÌïÑÏàò Ïª¨Îüº: Ï†ïÎ•òÏû•_ID, Ï†ïÎ•òÏû•_ÏàúÏÑú, ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨(m))
m = pd.read_csv(MASTER, dtype=str)
need = ["Ï†ïÎ•òÏû•_ID","Ï†ïÎ•òÏû•_ÏàúÏÑú","ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨(m)"]
missing = [c for c in need if c not in m.columns]
if missing:
    raise ValueError(f"ÎßàÏä§ÌÑ∞ CSVÏóê ÌïÑÏöîÌïú Ïª¨Îüº ÏóÜÏùå: {missing}")

m["Ï†ïÎ•òÏû•_ID"]   = m["Ï†ïÎ•òÏû•_ID"].astype(str)
m["Ï†ïÎ•òÏû•_ÏàúÏÑú"] = pd.to_numeric(m["Ï†ïÎ•òÏû•_ÏàúÏÑú"], errors="coerce")
m["ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"] = pd.to_numeric(m["ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨(m)"], errors="coerce")

# Í∞ôÏùÄ Ï†ïÎ•òÏû• ÏàúÏÑúÍ∞Ä Ïó¨Îü¨ Î≤à ÏûàÎäî Í≤ΩÏö∞ ÌèâÍ∑†ÏúºÎ°ú Ï∂ïÏïΩ (ÏïàÏ†Ñ)
m_stop = (m.groupby(["Ï†ïÎ•òÏû•_ID","Ï†ïÎ•òÏû•_ÏàúÏÑú"], as_index=False)["ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"]
            .mean())

# 2) DB Ïó∞Í≤∞
conn = sqlite3.connect(DB)
cur = conn.cursor()

# 3) stop_id + stop_seq Îß§Ïπ≠ÏúºÎ°ú ÏóÖÎç∞Ïù¥Ìä∏
cur.execute("BEGIN")
for _, r in m_stop.iterrows():
    if pd.isna(r["Ï†ïÎ•òÏû•_ÏàúÏÑú"]) or pd.isna(r["ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"]):
        continue
    cur.execute("""
        UPDATE daily_stop_hour
           SET ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m = ?
         WHERE Ï†ïÎ•òÏû•_ID = ?
           AND Ï†ïÎ•òÏû•_ÏàúÏÑú = ?
           AND (ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m IS NULL OR ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m = 0)
    """, (float(r["ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m"]), str(r["Ï†ïÎ•òÏû•_ID"]), int(r["Ï†ïÎ•òÏû•_ÏàúÏÑú"])))
conn.commit()

# 4) Í≤∞Í≥º ÌôïÏù∏ (ÏÉòÌîå)
import pandas as pd
df_check = pd.read_sql("""
SELECT Í∏∞Ï§Ä_ÎÇ†Ïßú, ÎÖ∏ÏÑ†ID, Ï†ïÎ•òÏû•_ID, Ï†ïÎ•òÏû•_ÏàúÏÑú, ÏãúÍ∞Ñ, ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m
FROM daily_stop_hour
WHERE ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m IS NOT NULL AND ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m > 0
ORDER BY Í∏∞Ï§Ä_ÎÇ†Ïßú, ÏãúÍ∞Ñ, Ï†ïÎ•òÏû•_ÏàúÏÑú
LIMIT 20;
""", conn)
conn.close()
df_check

         Í∏∞Ï§Ä_ÎÇ†Ïßú      ÎÖ∏ÏÑ†ID     Ï†ïÎ•òÏû•_ID  Ï†ïÎ•òÏû•_ÏàúÏÑú  ÏãúÍ∞Ñ    ÎßÅÌÅ¨_Íµ¨Í∞ÑÍ±∞Î¶¨_m
0   2025-06-01  11110028  106000469       1   0    57.285714
1   2025-06-01  11110028  110000308       1   0    11.400000
2   2025-06-01  11110028  117000132       1   0    27.857143
3   2025-06-01  11110028  123000440       1   0    85.000000
4   2025-06-01  11110028  100900029       2   0   181.000000
5   2025-06-01  11110028  100900032       2   0    69.000000
6   2025-06-01  11110028  100900034       2   0   486.000000
7   2025-06-01  11110028  100900035       2   0   179.000000
8   2025-06-01  11110028  100900036       2   0   199.000000
9   2025-06-01  11110028  100900038       2   0   200.000000
10  2025-06-01  11110028  100900188       2   0   176.000000
11  2025-06-01  11110028  100900202       2   0   259.000000
12  2025-06-01  11110028  101000309       2   0  1697.000000
13  2025-06-01  11110028  101000336       2   0   499.000000
14  2025-06-01  11110028  101900022       2   0   321.000000
15  2025-06-01  11110028  102900066       2   0   179.000000
16  2025-06-01  11110028  102900083       2   0   242.000000
17  2025-06-01  11110028  102900091       2   0   265.000000
18  2025-06-01  11110028  102900095       2   0   182.000000
19  2025-06-01  11110028  103000278       2   0  1266.000000